{
  "postId": 2,

  "title":"聊聊DDoS",

  "date": "2015-11-19",

  "author": "何掌柜",

  "content": [
    "今天来谈谈DoS，主要说说DDoS （Distributed Denial-of-Service attack）。只要你发行一个Public服务，就有可能被DDoS。初创公司尤其看人品，最初上线如果人品不好被攻击到了，真的是喊爹妈都没用。",
    "先说一个正常运作的服务，后代服务器一直在监听到来的用户请求。攻击无非就是来的请求traffic太多了服务器忙不过资源耗尽或者带宽耗尽了，那么更多的请求自然就会卡在门口,时间久了网络协议自然就会断开（Timeout），那你的服务可用性（Availbility）自然就低了。用户点击浏览器总是等到回复很慢甚至没有回复，自然恼怒。很多人想到解决办法自然是Scale up/out应用服务器，数据库服务器还有带宽。Scale up/out你的应用服务还好办，Scale out你的数据库那可就是个痛点了。还有你的网络带宽 (外界因素和服务器自身硬件NIC都可能成为Bottleneck，但host在云平台上一般主要取决于NIC了，因为带宽很好。云数据库存储服务可能会有带宽最大限制，取决于提供商)。话说回来就算你这样成功了，这不都是要花钱么。你可以买下一个Data Center来防御DDoS但是问题是，如果黑客来自竞争对手公司，那不已经成功的让你掉血了。今年8月25日，锤子手机发布“坚果手机”时官网遭到数十G的DDoS攻击就是一个例子，最后锤子是通过接入腾讯云的大禹系统才渡过难关。DDoS在很多情况下由于攻击者伪造发送的地址所以无法轻易分辨来是否是真用户，所以不可以轻易的过滤攻击者的包。先大概介绍一下几个软攻击方式，当然还有固件攻击，这篇文章里就不提了。",
    "消耗资源或带宽有几种方式：可以是伪造发件地址造成服务器回复ACK包到错误地址，然后一直等待接收下一个包却等不到从而造成半开放连接消耗资源；可以是发有片段重叠超载的IP包从而造成一些有Vulnerability的操作系统崩垮；可以是发超大量畸形的ping包来造成交通拥挤或操作系统崩溃；可以是用http post，攻击者可以请求自己发送一大批数据但却发的特别特别的慢，因为http header一般都会有content length并且服务器会履行协议来坚持连接收取文件从而占用资源，耗尽可用session或线程。这个顿时让我想到C#语言中的async异步编程可以做等待I/O时，不占用线程资源而是将线程放回线程池只是做一个callback，当回复包回来之后再指定一个新的线程跟进此请求，这样做更大的利用服务器资源，所以我觉得异步编程的出现在一定程度上也可减轻DDoS攻击的影响。同样的道理，消耗也可以是服务器回复用户但是用户却接的特别慢，不会Timeout但是保持接受最慢速度。最后还可以是用P2P的攻击，其效果最为剧烈。在一个P2P文件分享的session里如果攻击者作为master，可以使在这个session里的所有用户把traffic都发到目标攻击对象，造成服务器这边耗尽带宽。",
    "当黑客没有那么多电脑来同时进攻时，他可以操作大量僵尸机器在某一个时间同时发起对同一地址的攻击，并且非常的难检测到，因为这些机器都是大众的,被病毒感染后所控制，连owner也不知道，MyDoom就是这样一种病毒。另外也可以伪造自己的地址为被攻击地址然后广播给很多其他服务使他们的回复都去攻击对象地址。",
    "怎么样避免呢？你问我？我说靠你人品吧。DDoS大多数情况下只能被减轻却不能被彻底排查抵挡。就以上这些攻击方式你如何全部可以清清楚楚的分辨。一个好的机器学习算法也许可以帮助服务器探测出一些，但是方式都在变。当然，DDoS能进攻成功你的情况多数是在他能召集的团队的力量比你单个强大。这就是为什么大公司的网站很少被DDoS成功，因为服务器带宽相当大，防御措施的设备和技术全面。作为初创公司，搞了两台服务器，租用了某某.com的hosting服务，DDoS一来直接挂掉。都不用DDoS整你，前阵子Hostgator上来DNS就被黑了直接所有人登录自己的网站都跑到了黑客那里。所以最初用云提供商的服务器好处在于，他们可以用他们的方法替你探测，在一定程度上帮你分辨抵挡。就拿Azure来说吧。你想用一些简单的DDoS手法攻击里面任何的服务简直做梦。Azure networking有专门发觉DDoS并减轻的一层结构， 不但包括从外界来的traffic还有Azure内部的traffic，前阵子写了一个同步程序传一堆数据上去结果直接被Azure throttling了。还有之前一朋友的startup最早就差点被DDoS，但还好被AWS扛了下来。但这不代表你的服务不需要自己监控，强大的攻击这些也是不够的。你可以要么Scale，要么有自己独特的探查方式，要么拥有一个代理设备当作防火墙抵挡一下，但归根结底当你的规模过小却有一天遭受强大的进攻的，真是挡不了。看人品吧。"
  ],

  "description":"今天说说DDoS （Distributed Denial-of-Service attack）。只要你发行一个Public服务，就有可能被DDoS。初创公司尤其看人品，最初上线如果人品不好被攻击到了，真的是喊爹妈都没用。",

  "coverImg" : "Content/Image/PostImage/2_Cover.jpeg"
}